import {
  FingerSnapIcon,
  GlobeIcon,
  HeartRhythmIcon,
  PhoneInHandIcon,
  RecycleIcon,
  TeamIcon,
} from '@/public/images/story';
import { type Story } from '../types/story';

const story: Story = {
  aboutUsSection: {
    title: 'معلومات عنا',
    texts: [
      'نهدف من خلال نهجنا المبتكر إلى تقديم فحص أولي للأمراض التنفسية للمرضى والأطباء والحكومات، خاصة في البلدان ذات الدخل المنخفض.',
      'نطمح أن نكون المنظمة غير الربحية الرائدة في مجال التعرف على الأمراض باستخدام التكنولوجيا، ونعمل على تحويل الرعاية الصحية العالمية وإلهام الآخرين لدعم هذه المهمة والاستثمار فيها معنا.',
    ],
  },
  storySection: {
    title: 'القصة',
    texts: [
      [
        {
          type: 'text',
          text: 'عندما ضربت الجائحة،',
        },
        {
          type: 'link',
          url: '/amils-story',
          text: 'مؤسس فيروفي، أميل خانزادا',
        },
        {
          type: 'text',
          text: 'كان يعلم أن الهواتف الذكية موجودة في كل مكان وأن COVID-19 يؤثر على الأنف والحلق والرئتين.',
        },
      ],
      [
        {
          type: 'text',
          text: 'افترض أن أصوات التنفس والسعال يمكن تحليلها باستخدام التعلم الآلي لاكتشاف أنماط كوفيد.',
        },
      ],
      [
        {
          type: 'text',
          text: 'ورغبة منه في إحداث تأثير إيجابي، قام أميل بتنظيم دراسة سريرية شملت 362 مريضًا في مستشفى جامعي مرموق. بدأ فريق Virufy الأصلي مع طلاب خريجي الذكاء الاصطناعي في جامعة ستانفورد وتوسع ليشمل متطوعين من الجامعات على مستوى العالم.',
        },
      ],
    ],
  },
  valuesSection: {
    title: 'القيم',
    cards: [
      {
        title: 'التحول',
        image: RecycleIcon,
        imageText: 'رمز التكرار',
        text: 'نهدف إلى تحويل أنظمة الرعاية الصحية المكلفة باستخدام التكنولوجيا لدفع التغييرات اللازمة.',
      },
      {
        title: 'التعاون',
        image: GlobeIcon,
        imageText: 'رمز الكرة الأرضية',
        text: 'نلتزم بجعل الكشف السريع عن الأمراض متاحًا لكل شخص في العالم، بغض النظر عن خلفيته.',
      },
      {
        title: 'الصحة',
        image: HeartRhythmIcon,
        imageText: 'رمز إيقاع القلب',
        text: 'نلتزم دائمًا بوضع صحة ورفاهية جميع الأشخاص في جميع أنحاء العالم في المقام الأول.',
      },
      {
        title: 'القدرة على تحمل التكاليف',
        image: TeamIcon,
        imageText: 'رمز مجموعة من الأشخاص',
        text: 'نهدف إلى استخدام التكنولوجيا لجعل الوقاية من الأمراض والكشف عنها مجانيًا لجميع الأشخاص في جميع أنحاء العالم.',
      },
      {
        title: 'الكفاءة',
        image: FingerSnapIcon,
        imageText: 'رمز التصفيق بالأصابع',
        text: 'نلتزم بإنشاء تقنيات بديهية توفر الكشف السريع، مما يوقف انتشار الفيروس وينقذ الأرواح.',
      },
      {
        title: 'الابتكار',
        image: PhoneInHandIcon,
        imageText: 'رمز الهاتف في اليد',
        text: 'نهدف إلى ضمان الكشف السريع عن الأمراض بنقرة واحدة فقط على جهاز محمول.',
      },
    ],
  },
  privacySection: {
    title: 'التزامنا بالخصوصية',
    texts: [
      'يأخذ Virufy خصوصية وحماية معلوماتك الشخصية على محمل الجد. قام فريقنا القانوني بإعداد سياسة خصوصية مفصلة وسياسة ملفات تعريف الارتباط لحماية المعلومات الشخصية التي تشاركها معنا من خلال استخدام موقعنا.',
    ],
  },
};

export default story;
